import { TheoryPart } from "../../types";

export const colors_parts: TheoryPart[] = [
  {
    htmlContent: `
      <p>Призначення колірної моделі - дати засоби опису кольору в межах деякого колірного діапазону.</p>
      <p>Кожна модель має своє призначення, тобто ефективна для виконання окремих операцій.</p>
      <p>Запропоновано класифікувати моделі за принципом апаратної залежності. <strong>Апаратно-орієнтовані триколірні моделі</strong> - це <span style="color: #ff0000;">RGB</span> (<span style="color: #ff0000;">αRGB, sRGB</span>), <span style="color: #00ffff;">CMY</span> (<span style="color: #00ffff;">CMYK</span>). <strong>Апаратно-незалежні триатрибутні моделі</strong>, які поділяються на <em>перцепційні</em> <span style="color: #ff00ff;">HSV, HSL, HSІ, HSВ</span> і т.д. та модифіковані <span style="color: #999999;">CIE XYZ, CIE Lab</span>, …</p>
      <p><strong>Адитивна модель RGB</strong> - це апаратно-орієнтована модель, в якій кольори описуються за допомогою змішування трьох базових кольорів – червоного (<span style="color: #ff0000;">Red</span>), зеленого (<span style="color: #00ff00;">Green</span>), синього (<span style="color: #0000ff;">Blue</span>) – в різних пропорціях. Тому модель RGB називається адитивною (від англ. «add» складати, додавати). Ця модель поширена у моніторах, сканерах, проекторах, інших пристроях, які фізично створююють кольори в такий самий спосіб.</p>
    `
  }, 
  {
    image: '/theory/colors-1.png'
  },
  {
    htmlContent: `
      <p><strong>Недолік RGB</strong> - обмеженість у застосуванні, лише на пристроях, які працюють за принципом випромінювання, неможливість відображення деяких кольорів, а саме насичених зелено-синіх.</p>
      <p><strong>HSL</strong> - перцепційна модель, в якій колір утворюється за допомогою трьох параметрів для визначення кольору: відтінок (<em>Hue</em>), насиченість (<em>Saturation</em>) та світлота (<em>Lightness</em>). Ця модель називається перцепційною, бо вона є заточеною під людське інтуїтивне сприйняття кольору.</p>
    ` 
  },
  {
    image: '/theory/colors-2.png'
  },
  {
    htmlContent: `
      Недолік HSL - три параметри є лінійно-залежними, якщо взяти зображення в кольоровому просторі HSL, у якому відтінок і насиченість залишаються постійними, а лише світлота змінюється, то ви отримаєте градієнт кольорів від темного до світлого або навпаки. Це відбувається, оскільки змінюючи світлоту, ми змінюємо яскравість кольорів, а вони можуть здаватися темнішими чи світлішими.
    `
  }

]